# -*- coding: utf-8 -*-
import requests
import urllib
import orjson
import pandas as pd

def get_created_date(page_title):
    #page_title='삼성전자'
    page_title = urllib.parse.quote(page_title)
    url = f'https://ko.wikipedia.org/w/api.php?action=query&prop=revisions&rvlimit=1&rvprop=timestamp&rvdir=newer&format=json&titles={page_title}'
    response = requests.get(url)
    datestring = response.json()['query']['pages'].popitem()[1]['revisions'][-1]['timestamp']
    return datestring[0:10].replace('-','')
    
def crawl(page_title, access, agent, start, end):
    '''
    :param string page_title: wiki page title to be crawled
    :param string access: all-access, desktop, mobile-app or mobile-web.
    :param srring agent: all-agents, user, spider, automated
    :param string start: YYYYMMDD
    :param string end: YYYYMMDD
    :returns: json date count
    '''
    project = 'ko.wikipedia'
    granularity = 'daily'
    page_title = urllib.parse.quote(page_title)
    url = f'https://wikimedia.org/api/rest_v1/metrics/pageviews/per-article/{project}/{access}/{agent}/{page_title}/{granularity}/{start}/{end}'
    response = requests.get(url)
    return orjson.loads(response.text)    #response.json()

def crawl_all(keywords,cfg,enddate):
    end = enddate
    dfs = []
    for keyword in keywords:
        #start = get_created_date(keyword)
        start = '20060101'
        try: 
            dfs += [
                pd.Series( { x['timestamp']:x['views'] for x in crawl(keyword,x[0],x[1],start,end)['items'] } ).rename((keyword,'_'.join(x)))
                for x in cfg
            ]
        except:
            print(f'Error : {keyword}')
        print(keyword)
    return pd.concat(dfs, axis=1)

def test():
    from datetime import date
    enddate = date.today().strftime("%Y%m%d")
    cfg = [('all-access','all-agents'),('desktop','user'),('mobile-web','user'),('mobile-app','user')]
    kws = ['삼성전자']
    df = crawl_all(kws, cfg, enddate)
    
def main():
    from datetime import date
    enddate = date.today().strftime("%Y%m%d")
    kws = ['AJ가족','AK홀딩스','BGF_(기업)','BGF리테일','BNK금융그룹','CAS_(기업)','CJ_(기업)','CJ_CGV','CJ_이엔엠','CJ대한통운','CJ제일제당','CJ프레시웨이','CMS에듀','DB_Inc.','DB금융투자','DB손해보험','DB하이텍','DGB금융그룹','DSR_(기업)','E1_(기업)','EMW','ESA_(기업)','GC녹십자','GS_(기업)','GS_SHOP','GS건설','GS글로벌','GS리테일','HDC_(기업)','HDC아이콘트롤스','HDC현대EP','HDC현대산업개발','HSD엔진','IBK저축은행','IHQ','iMBC','JB금융지주','JYP_엔터테인먼트','KB금융그룹','KCC_(기업)','KEC_(기업)','KH바텍','KJ프리텍','KMH','KNN','KPX케미칼','KR모터스','KT','KT&G','KTB투자증권','KT스카이라이프','LF_(기업)','LG_(기업)','LG디스플레이','LG상사','LG생활건강','LG유플러스','LG이노텍','LG전자','LG하우시스','LG헬로비전','LG화학','LIG넥스원','LS_(기업)','LS네트웍스','LS일렉트릭','MP그룹','NE능률','NHN','NHN벅스','NH투자증권','NICE그룹','NPC_(기업)','OCI_(기업)','S&TC','S&T그룹','S&T모티브','S&T중공업','SBI인베스트먼트','SBS_(대한민국의_방송사)','SBS미디어홀딩스','SFA_(기업)','SG세계물산','SK_(기업)','SKC','SK네트웍스','SK머티리얼즈','SK이노베이션','SK증권','SK케미칼','SK텔레콤','SK하이닉스','SL_(기업)','SM_엔터테인먼트','SNK','S-OIL','SPC삼립','STX_(기업)','STX엔진','STX중공업','TBC_(대한민국의_방송사)','THE_E&M','TJ미디어','TLi','TPC_메카트로닉스','W홀딩컴퍼니','YBM','YES24','YG_엔터테인먼트','YG플러스','YTN','가비아','가온미디어','강원랜드','갤럭시아에스엠','게임빌','경남제약','경농','경동가스','경동나비엔','경동제약','경방','경인양행','계룡건설','고려개발','고려아연','고려제강','고려제약','고영테크놀러지','광동제약','광명전기','광주신세계','교보증권','국도화학','국순당','국일제지','국제약품','그랜드코리아레저','금호산업','금호석유화학','금호타이어','기가레인','기아자동차','깨끗한나라','나이스평가정보','남광토건','남선알미늄','남양유업','남해화학','내츄럴엔도텍','네오위즈','네오위즈홀딩스','네이버_(기업)','넥센타이어','넥슨지티','넷마블_(기업)','농심','농심홀딩스','농우바이오','다나와','다날','다산네트웍스','다우기술','다원시스','대교_(기업)','대구백화점','대덕전자','대림산업','대상_(기업)','대상홀딩스','대성미생물','대성쎌틱에너시스','대신증권','대양금속','대우건설','대우전자부품','대우조선해양','대웅','대웅제약','대원강업','대원미디어','대유에이텍','대한광통신','대한뉴팜','대한유화','대한전선','대한제분','대한항공','대한해운','대호에이엘','더존IT그룹','덕산하이메탈','데브시스터즈','동국제강','동국제약','동방_(기업)','동부건설','동성제약','동신건설','동아쏘시오홀딩스','동아타이어','동양_(기업)','동양고속','동원F&B','동원산업','동일금속','동일금속','동화기업','동화약품','두산','두산건설','두산인프라코어','두산중공업','디아이','디엔에이링크','디지털대성','디지틀조선','디티알오토모티브','라온시큐어','라온피플','락앤락','롯데관광개발','롯데백화점','롯데손해보험','롯데정밀화학','롯데제과','롯데지주','롯데칠성음료','롯데케미칼','롯데푸드','롯데하이마트','룽투코리아','리드코프','마니커','마크로젠','만도','매일유업','맥쿼리한국인프라투융자회사','메가스터디','메가스터디교육','메디앙스','메디톡스','메디포스트','메리츠화재해상보험','명문제약','모나미','모두투어','모토닉','무림피앤피','무학_(기업)','미래나노텍','미래산업','미래에셋대우','미래에셋생명보험','바른손','바른손이앤에이','바이넥스','버추얼텍','범양건영','베셀_(기업)','베스파','벽산그룹','보령제약','보해양조','부광약품','부국증권','비비안_(기업)','비상교육','비와이씨','빙그레','사조대림','사조산업','사조오양','삼광글라스','삼보판지','삼부토건','삼성SDI','삼성SDS','삼성물산','삼성생명보험','삼성엔지니어링','삼성전기','삼성전자','삼성제약','삼성중공업','삼성증권','삼성카드','삼성화재해상보험','삼아제약','삼양사','삼양식품','삼양통상','삼양홀딩스','삼익THK','삼익악기','삼일제약','삼진제약','삼천당제약','삼천리자전거','삼표시멘트','삼호개발','삼화네트웍스','상보','상상인증권','상신브레이크','샘표_(기업)','샘표식품','서린바이오사이언스','서울반도체','서울식품공업','서호전기','서희건설','성광벤드','성신양회','성안','세방전지','세아베스틸','세아제강지주','세종공업','세종텔레콤','셀바스AI','셀트리온','소리바다','소프트센','소프트캠프','손오공_(기업)','솔고바이오','솔본','송원산업','쇼박스','슈프리마에이치큐','스튜디오드래곤','시너지이노베이션','신도리코','신세계_(백화점)','신세계건설','신신제약','신영와코루','신영증권','신풍제약','신한','신한금융지주','실리콘웍스','쌍방울','쌍용양회공업','쌍용자동차','써니전자','썬텍','씨씨에스','씨유메디칼시스템','씨젠','아가방컴퍼니','아남전자','아모레퍼시픽','아모레퍼시픽그룹','아시아나항공','아이에스동서','아이오케이컴퍼니','아주캐피탈','아진산업','아프리카TV','안랩','애경산업','액토즈소프트','에스넷','에스원','에스제이케이','에어부산','에이블씨엔씨','에이스침대','에이스토리','에이치엘비','에이프로젠제약','에프앤에프','엔씨소프트','엔케이','영원무역','영인프런티어','영진약품','영풍_(기업)','오공','오뚜기','오로라월드','오리엔탈정공','오리엔트바이오','오리온_(대한민국의_기업)','오리온홀딩스','오스템임플란트','오픈베이스','와이디온라인','용평리조트','우리기술','우리기술투자','우리들제약','우리들휴브레인','우리은행','우성사료','웅진에너지','원익큐브','위니아딤채','유니드','유비쿼스','유성기업','유수홀딩스','유안타증권','유유제약','유진기업','유진투자증권','유한양행','유화증권','이건산업','이건홀딩스','이-글_벳','이노션','이노와이어리스','이리츠코크렙기업구조조정부동산투자회사','이마트','이매진아시아','이베스트투자증권','이상네트웍스','이수앱지스','이수페타시스','이수화학','이스트소프트','이아이디','이원다이애그노믹스','이월드','이트론','이화공영','이화전기','인디에프','인바디_(회사)','인탑스','인터파크','인텔리안_테크놀로지스','일동제약','일동홀딩스','일성신약','일양약품','일진다이아몬드','일진디스플레이','일진머티리얼즈','잉크테크','전방','제이씨현시스템','제이에스티나','제일기획','제일바이오','제일약품','제주은행','제주항공','조광페인트','조광피혁','조선내화','조성아','종근당','종근당홀딩스','주연테크','중앙백신','지니뮤직','지투알','진에어','진원생명과학','진흥기업','차바이오텍','차바이오텍','참좋은여행','천일고속','청담러닝','청호컴넷','초록뱀미디어','충방그룹','카카오_(기업)','카프로','컴투스','케이아이엔엑스','케이티씨에스','코닉글로리','코리안리재보험','코스맥스','코스모신소재','코오롱그룹','코오롱글로벌','코오롱인더스트리','코인플러그','쿠쿠홀딩스','큐브_엔터테인먼트','큐캐피탈','크라운제과','크라운해태홀딩스','키움증권','키위미디어그룹','키이스트','탑엔지니어링','태광','태광산업','태양금속공업','태영건설','태웅_(기업)','토니모리','토비스','특수건설','티비에이치글로벌','티웨이항공','티웨이홀딩스','파라다이스_(기업)','파루_(기업)','파미셀','파이오링크','파인디앤씨','파크시스템스','판타지오','팬_엔터테인먼트','팬오션','퍼시스','펄어비스','페이퍼코리아','펩트론','포스코','포스코_ICT','포스코강판','포스코인터내셔널','포스코케미칼','푸른저축은행','풀무원','풍산_(기업)','풍산홀딩스','퓨쳐스트림네트웍스','프로텍','플레이위드','피에스엠씨','피에스텍','피엔티','하나금융그룹','하나마이크론','하림_(기업)','하이비젼시스템','하이트진로','하이트진로홀딩스','하츠','한국가구','한국가스공사','한국경제TV','한국단자','한국쉘석유','한국전자홀딩스','한국정보공학','한국정보통신','한국종합기술','한국철강','한국캐피탈','한국콜마','한국큐빅','한국타이어앤테크놀로지','한국테크놀로지그룹','한국프랜지','한국항공우주산업','한국화장품','한독','한라홀딩스','한미글로벌','한미약품','한솔제지','한솔홀딩스','한양증권','한화','한화생명보험','한화손해보험','현대건설','현대로템','현대약품','현대차증권','현대해상화재보험','현대홈쇼핑','환인제약','효성_(기업)','흥국화재해상보험']
    cfg = [('all-access','all-agents'),('desktop','user'),('mobile-web','user'),('mobile-app','user')]
    df = crawl_all(kws, cfg, enddate)
    return df.sort_index()

df = main()
df.to_csv('crawl.csv')
pd.read_csv('crawl.csv',index_col=0, header=[0,1], parse_dates=True)